<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"f8ee3832df24e8a170207d47c95d9871ba12220bdb34cc7928fd152eb5d77f8e","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #815 at https://github.com/cal-itp/data-infra/actions/runs/18605948458","plan_out_hash":"622d9522f27a12a1c38e3717a09ac1abf50f73bff5fdffbdfe08aab71f92bc92","plan_hash":"7bb86924f52663c042c73ed10aec451de4e654b34088c7fd6d43d5dffcd5cc2b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 2 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-catalog will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-catalog" {
!~      content             = (sensitive value)
!~      crc32c              = "DjRQSg==" -> (known after apply)
!~      detect_md5hash      = "nmCpPb8hpvmODl5nzYZdgw==" -> "different hash"
!~      generation          = 1760652964804161 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/catalog.json"
!~      md5hash             = "nmCpPb8hpvmODl5nzYZdgw==" -> (known after apply)
        name                = "data/warehouse/target/catalog.json"
#        (16 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-manifest will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-manifest" {
!~      content             = (sensitive value)
!~      crc32c              = "ifexaA==" -> (known after apply)
!~      detect_md5hash      = "Hp6bShBq6+PWspFRO1Ytyg==" -> "different hash"
!~      generation          = 1760652966565768 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/target/manifest.json"
!~      md5hash             = "Hp6bShBq6+PWspFRO1Ytyg==" -> (known after apply)
        name                = "data/warehouse/target/manifest.json"
#        (16 unchanged attributes hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #815](https://github.com/cal-itp/data-infra/actions/runs/18605948458)